# StructuralSectionConcreteCross Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionConcreteCross Class
Members See Also
---
Defines parameters for parameterized concrete cross structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionConcreteCross : StructuralSectionRectangular
```

Visual Basic
---
```text
Public Class StructuralSectionConcreteCross _
	Inherits StructuralSectionRectangular
```

Visual C++
---
```text
public ref class StructuralSectionConcreteCross : public StructuralSectionRectangular
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteCross
# See Also
StructuralSectionConcreteCross Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace